OK, I'll give it a try. The values in the `x509_certificate_properties` block don't match those in the certificate, e.g. the CN and the keyUsage fields are different; this seems to be causing a persistent diff since it looks like KV (correctly) uses the values from the certificate.

<details>
<summary>example output</summary>

```
          # azurerm_key_vault_certificate.test must be replaced
        -/+ resource "azurerm_key_vault_certificate" "test" {
              ~ certificate_attribute   = [
                  - {
                      - created        = "2021-08-24T13:10:00Z"
                      - enabled        = true
                      - expires        = "2031-04-20T19:58:10Z"
                      - not_before     = "2021-04-22T19:58:10Z"
                      - recovery_level = "Recoverable+Purgeable"
                      - updated        = "2021-08-24T13:10:00Z"
                    },
                ] -> (known after apply)
              ~ certificate_data        = "308203923082027A020900D8D40E1A52F4D9D1300D06092A864886F70D01010B050030818A310B3009060355040613024348310B300906035504080C025A48310B300906035504070C025A4831123010060355040A0C095465727261666F726D310E300C060355040B0C05417A7572653118301606035504030C0F7777772E636F6E746F736F2E636F6D3123302106092A864886F70D0109011614776861746576657240636F6E746F736F2E636F6D301E170D3231303432323139353831305A170D3331303432303139353831305A30818A310B3009060355040613024348310B300906035504080C025A48310B300906035504070C025A4831123010060355040A0C095465727261666F726D310E300C060355040B0C05417A7572653118301606035504030C0F7777772E636F6E746F736F2E636F6D3123302106092A864886F70D0109011614776861746576657240636F6E746F736F2E636F6D30820122300D06092A864886F70D01010105000382010F003082010A0282010100E6BC777D337451457592D7ADCCCD8010827864A42589BACBB553913D7D8B429D9597F9FBE033C3D917BF6603B636D8E18C8B583BAE594AA3A01B3DD1F040F8AF5D80A242C2166AA10679EBE08C9B79A428B3BA6B8CB2B0488CA3E4D6D5306BB334EE8FE795B5CD331F57E0ACB5B0AD5ED44F6BBCE2CD78D86D3DDD7E9C3C16024B87DB1559A8823B7E0DBBD3D617D351225CC87BF124DECB3F26736AB241FEC67C60C6AEBCB256996B8AA88C18E22E5FC8748B3803D0EDC899C577DF71BA1F274A1320E3291C70FAFDFFE6016B3F3F11FEFFCE65E3DE0F432D3AC86BB255EACF34579A1520D685ECA5EEF639A30FE6B4DD2B11FFC78A5FA2BEC4306DAB1A73F30203010001300D06092A864886F70D01010B050003820101000E19EDA49C25718DED3A8A17E1CE9AE0EE54CCEC60A0897A9AE1F742570AB4849018A4C836F45EC37F7384FF3543FE6CDD45665EDB2553638EDF60511F0CA3269067A982A202B34C137E105285A9BCBE4936C837284F4D4B6ABF889B7193A0FDC948CE5815BAB16A6D11FC056C904E5A1D0FAD20653072EC168638CA42E5AE6B9F6D2345128E019A2B7719E6DC853903DC137645CE7756337473A233471F9509393EF3B7845E6C1CC646970D76B6E43AD564455648C07D3025F9B8E3347E2F7E948695D477C5C62AFB9A28596A261C3FF14B58CD75D7E5BC076FF25390E2D46ECF20A1B1B6DE5161C571B9421AADC2A6271D7470F4985C96FF29C1E1209A19E3" -> (known after apply)
              ~ certificate_data_base64 = "MIIDkjCCAnoCCQDY1A4aUvTZ0TANBgkqhkiG9w0BAQsFADCBijELMAkGA1UEBhMCQ0gxCzAJBgNVBAgMAlpIMQswCQYDVQQHDAJaSDESMBAGA1UECgwJVGVycmFmb3JtMQ4wDAYDVQQLDAVBenVyZTEYMBYGA1UEAwwPd3d3LmNvbnRvc28uY29tMSMwIQYJKoZIhvcNAQkBFhR3aGF0ZXZlckBjb250b3NvLmNvbTAeFw0yMTA0MjIxOTU4MTBaFw0zMTA0MjAxOTU4MTBaMIGKMQswCQYDVQQGEwJDSDELMAkGA1UECAwCWkgxCzAJBgNVBAcMAlpIMRIwEAYDVQQKDAlUZXJyYWZvcm0xDjAMBgNVBAsMBUF6dXJlMRgwFgYDVQQDDA93d3cuY29udG9zby5jb20xIzAhBgkqhkiG9w0BCQEWFHdoYXRldmVyQGNvbnRvc28uY29tMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA5rx3fTN0UUV1ktetzM2AEIJ4ZKQlibrLtVORPX2LQp2Vl/n74DPD2Re/ZgO2NtjhjItYO65ZSqOgGz3R8ED4r12AokLCFmqhBnnr4IybeaQos7prjLKwSIyj5NbVMGuzNO6P55W1zTMfV+CstbCtXtRPa7zizXjYbT3dfpw8FgJLh9sVWaiCO34Nu9PWF9NRIlzIe/Ek3ss/JnNqskH+xnxgxq68slaZa4qojBjiLl/IdIs4A9DtyJnFd99xuh8nShMg4ykccPr9/+YBaz8/Ef7/zmXj3g9DLTrIa7JV6s80V5oVINaF7KXu9jmjD+a03SsR/8eKX6K+xDBtqxpz8wIDAQABMA0GCSqGSIb3DQEBCwUAA4IBAQAOGe2knCVxje06ihfhzprg7lTM7GCgiXqa4fdCVwq0hJAYpMg29F7Df3OE/zVD/mzdRWZe2yVTY47fYFEfDKMmkGepgqICs0wTfhBSham8vkk2yDcoT01Lar+Im3GToP3JSM5YFbqxam0R/AVskE5aHQ+tIGUwcuwWhjjKQuWua59tI0USjgGaK3cZ5tyFOQPcE3ZFzndWM3RzojNHH5UJOT7zt4RebBzGRpcNdrbkOtVkRVZIwH0wJfm44zR+L36UhpXUd8XGKvuaKFlqJhw/8UtYzXXX5bwHb/JTkOLUbs8gobG23lFhxXG5QhqtwqYnHXRw9Jhclv8pweEgmhnj" -> (known after apply)
              ~ id                      = "https://tlskv210824140712311381.vault.azure.net/certificates/AzureFirewallPolicyCertificate/d1914baa2eb046acb40f3fccac5a427b" -> (known after apply)
                name                    = "AzureFirewallPolicyCertificate"
              ~ secret_id               = "https://tlskv210824140712311381.vault.azure.net/secrets/AzureFirewallPolicyCertificate/d1914baa2eb046acb40f3fccac5a427b" -> (known after apply)
              ~ thumbprint              = "89CD395A2E0952B6B0FF29A05074FF16F026C2B6" -> (known after apply)
              ~ version                 = "d1914baa2eb046acb40f3fccac5a427b" -> (known after apply)
                # (1 unchanged attribute hidden)
        
              ~ certificate {
                    # (1 unchanged attribute hidden)
                }
        
              ~ certificate_policy {
        
                  ~ key_properties {
                      + curve      = (known after apply)
                        # (4 unchanged attributes hidden)
                    }
        
        
                  ~ x509_certificate_properties {
                      ~ extended_key_usage = [ # forces replacement
                          + "1.3.6.1.5.5.7.3.1",
                          + "1.3.6.1.5.5.7.3.2",
                        ]
                      ~ key_usage          = [ # forces replacement
                          + "cRLSign",
                          + "dataEncipherment",
                          + "digitalSignature",
                          + "keyAgreement",
                          + "keyCertSign",
                          + "keyEncipherment",
                        ]
                      ~ subject            = "E=whatever@contoso.com, CN=www.contoso.com, OU=Azure, O=Terraform, L=ZH, S=ZH, C=CH" -> "CN=api.pluginsdk.io" # forces replacement
                      ~ validity_in_months = 120 -> 1 # forces replacement
        
                        # (1 unchanged block hidden)
                    }
                    # (2 unchanged blocks hidden)
                }
            }
```

</details>